IRP/src/Documents/ShipmentConfirmation/ShipmentConfirmation.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ShipmentConfirmation</name>
  <registerRecords>AccumulationRegister.R4010B_ActualStocks</registerRecords>
  <registerRecords>AccumulationRegister.R4022B_StockTransferOrdersShipment</registerRecords>
  <registerRecords>AccumulationRegister.R2011B_SalesOrdersShipment</registerRecords>
  <registerRecords>AccumulationRegister.R4032B_GoodsInTransitOutgoing</registerRecords>
  <registerRecords>AccumulationRegister.R4012B_StockReservation</registerRecords>
  <registerRecords>AccumulationRegister.R2013T_SalesOrdersProcurement</registerRecords>
  <registerRecords>AccumulationRegister.R4034B_GoodsShipmentSchedule</registerRecords>
  <registerRecords>AccumulationRegister.R2031B_ShipmentInvoicing</registerRecords>
  <registerRecords>AccumulationRegister.R4011B_FreeStocks</registerRecords>
  <registerRecords>AccumulationRegister.T10000B_RowIDMovements</registerRecords>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>LegalName</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Partner</name>
    <type>
      <types>CatalogRef.Partners</types>
    </type>
  </attributes>
  <attributes>
    <name>TransactionType</name>
    <type>
      <types>EnumRef.ShipmentConfirmationTransactionTypes</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ItemList</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>ItemKey</name>
      <type>
        <types>CatalogRef.ItemKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Store</name>
      <type>
        <types>CatalogRef.Stores</types>
      </type>
    </attributes>
    <attributes>
      <name>Unit</name>
      <type>
        <types>CatalogRef.Units</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>ShipmentBasis</name>
      <type>
        <types>DefinedType.typeShipmentBasis</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityInBaseUnit</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesOrder</name>
      <type>
        <types>DocumentRef.SalesOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>SalesInvoice</name>
      <type>
        <types>DocumentRef.SalesInvoice</types>
      </type>
    </attributes>
    <attributes>
      <name>InventoryTransferOrder</name>
      <type>
        <types>DocumentRef.InventoryTransferOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>InventoryTransfer</name>
      <type>
        <types>DocumentRef.InventoryTransfer</types>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseReturnOrder</name>
      <type>
        <types>DocumentRef.PurchaseReturnOrder</types>
      </type>
    </attributes>
    <attributes>
      <name>PurchaseReturn</name>
      <type>
        <types>DocumentRef.PurchaseReturn</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>RowIDInfo</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>RowID</name>
      <type>
        <types>DefinedType.typeRowID</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.typeQuantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Basis</name>
      <type>
        <types>DocumentRef</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrentStep</name>
      <type>
        <types>CatalogRef.MovementRules</types>
      </type>
    </attributes>
    <attributes>
      <name>NextStep</name>
      <type>
        <types>CatalogRef.MovementRules</types>
      </type>
    </attributes>
    <attributes>
      <name>RowRef</name>
      <type>
        <types>CatalogRef.RowIDs</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

IRP/src/Catalogs/Units/Units.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Units</name>
  <attributes>
    <name>Item</name>
    <type>
      <types>CatalogRef.Items</types>
    </type>
  </attributes>
  <attributes>
    <name>Quantity</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>BasisUnit</name>
    <type>
      <types>CatalogRef.Units</types>
    </type>
  </attributes>
  <attributes>
    <name>UOM</name>
    <type>
      <types>CatalogRef.UnitsOfMeasurement</types>
    </type>
  </attributes>
  <tabularSections>
    <name>AddAttributes</name>
    <attributes>
      <name>Property</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>Characteristic.AddAttributeAndProperty</types>
      </type>
    </attributes>
    <attributes>
      <name>SearchLiteral</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Documents/ShipmentConfirmation/Forms/SelectShipmentBasisesForm/Module.bsl
&AtServer
Procedure OnCreateAtServer(Cancel, StandardProcessing)
	SelectShipmentBasisMode = Parameters.SelectShipmentBasisMode;
	If Parameters.Property("FilterValues") Then
		FillDocumentsTree(Parameters.FilterValues, Parameters.ExistingRows, Parameters.Ref);
	Else
		Cancel = True;
	EndIf;
	SetConditionalAppearance();
	SetVisibility();
EndProcedure

&AtServer
Procedure SetVisibility()
	Items.FormSelectAll.Visible = Not SelectShipmentBasisMode;
	Items.FormUnselectAll.Visible = Not SelectShipmentBasisMode;
	Items.DocumentsTreeUse.Visible = Not SelectShipmentBasisMode;
EndProcedure

&AtServer
Procedure SetConditionalAppearance()
	ConditionalAppearance.Items.Clear();
	
	AppearanceElement = ConditionalAppearance.Items.Add();
	
	FieldElement = AppearanceElement.Fields.Items.Add();
	FieldElement.Field = New DataCompositionField(Items.DocumentsTreeShipmentBasis.Name);
	FieldElement = AppearanceElement.Fields.Items.Add();
	FieldElement.Field = New DataCompositionField(Items.DocumentsTreeCurrency.Name);
	
	FilterElement = AppearanceElement.Filter.Items.Add(Type("DataCompositionFilterItem"));
	FilterElement.LeftValue = New DataCompositionField("DocumentsTree.ItemKey");
	FilterElement.ComparisonType = DataCompositionComparisonType.Filled;
	
	AppearanceElement.Appearance.SetParameterValue("Text", "");
EndProcedure

&AtServer
Procedure FillDocumentsTree(FilterValues, ExistingRows, Ref)
	ThisObject.DocumentsTree.GetItems().Clear();


	
	FilterTable = QueryTable.Copy( , "ShipmentBasis");
	FilterTable.GroupBy("ShipmentBasis");
	
	For Each Row_Basis In FilterTable Do
		
		NewRow_Basis = ThisObject.DocumentsTree.GetItems().Add();
		NewRow_Basis.ShipmentBasis = Row_Basis.ShipmentBasis;
		
		BasisItemsArray = QueryTable.FindRows(New Structure("ShipmentBasis", Row_Basis.ShipmentBasis));
		For Each Row_Item In BasisItemsArray Do
			
			// exclude quantity from existing rows
			ExistingQuantity = 0;
			For i = 0 To ExistingRows.UBound() Do
				If i > ExistingRows.UBound() Then
					Break;
				EndIf;
				
				ExistingRow = ExistingRows[i];
				If ExistingRow.Key = Row_Item.Key Then
					UnitFactor = Catalogs.Units.GetUnitFactor(ExistingRow.Unit, Row_Item.Unit);
					ExistingQuantity = Min(ExistingQuantity + ExistingRow.Quantity / UnitFactor, Row_Item.Quantity);
					ExistingRows.Delete(i);
					i = i - 1;
				EndIf;
			EndDo;
			
			If ExistingQuantity < Row_Item.Quantity Then
				NewRow_Item = NewRow_Basis.GetItems().Add();
				FillPropertyValues(NewRow_Item, Row_Item);
				NewRow_Item.Quantity = NewRow_Item.Quantity - ExistingQuantity;
			EndIf;
		EndDo;
		If Not NewRow_Basis.GetItems().Count() Then
			DocumentsTree.GetItems().Delete(NewRow_Basis);
		EndIf;
	EndDo;
	
EndProcedure

&AtClient
Procedure DocumentsTreeUseOnChange(Item)
	CurrentRow = DocumentsTree.FindByID(Items.DocumentsTree.CurrentRow);
	If CurrentRow = Undefined Then
		Return;
	EndIf;
	
	For Each Row In CurrentRow.GetItems() Do
		Row.Use = CurrentRow.Use;
		For Each Row_ In Row.GetItems() Do
			Row_.Use = CurrentRow.Use;
		EndDo;
	EndDo;
EndProcedure

&AtClient
Procedure DocumentsTreeBeforeAddRow(Item, Cancel, Clone, Parent, IsFolder, Parameter)
	Cancel = True;
EndProcedure

&AtClient
Procedure DocumentsTreeBeforeDeleteRow(Item, Cancel)
	Cancel = True;
EndProcedure

&AtClient
Procedure Command_Ok(Command)
	If SelectShipmentBasisMode Then
		If Items.DocumentsTree.CurrentRow = Undefined Then
			If Not DocumentsTree.GetItems().Count() Then
				Close(Undefined);
			EndIf;
			Return;
		EndIf;
		Row_Item = DocumentsTree.FindByID(Items.DocumentsTree.CurrentRow);
		If Row_Item = Undefined Then
			Close(Undefined);
			Return;
		EndIf;
		If Not ValueIsFilled(Row_Item.ShipmentBasis) Then
			Return;
		EndIf;
		
		Result = New Array();
		RowStructure = New Structure("ShipmentBasis, Store, Item, ItemKey, Key, Unit, Quantity");
		FillPropertyValues(RowStructure, Row_Item);
		Result.Add(RowStructure);
		Close(Result);
	Else
		Close(GetSelectedData());
	EndIf;
EndProcedure

&AtClient
Procedure DocumentsTreeSelection(Item, RowSelected, Field, StandardProcessing)
	Command_Ok(Undefined);
EndProcedure

&AtServer
Function GetSelectedData()
	Result = New Array();
	
	For Each Row_Currency In ThisObject.DocumentsTree.GetItems() Do
		For Each Row_Order In Row_Currency.GetItems() Do
			For Each Row_Item In Row_Order.GetItems() Do
				If Row_Item.Use Then
					RowStructure = New Structure("ShipmentBasis, Store, Item, ItemKey, Key, Unit, Quantity");
					FillPropertyValues(RowStructure, Row_Item);
					Result.Add(RowStructure);
				EndIf;
			EndDo;
		EndDo;
	EndDo;
	Return Result;
EndFunction

&AtClient
Procedure Cancel(Command)
	Close();
EndProcedure

&AtClient
Procedure SelectAll(Command)
	SetUseValue(True);
EndProcedure

&AtClient
Procedure UnselectAll(Command)
	SetUseValue(False);
EndProcedure

&AtClient
Procedure SetUseValue(UseValue)
	For Each Row_Currency In DocumentsTree.GetItems() Do
		Row_Currency.Use = UseValue;
		For Each Row_Basis In Row_Currency.GetItems() Do
			Row_Basis.Use = UseValue;
			For Each Row_Item In Row_Basis.GetItems() Do
				Row_Item.Use = UseValue;
			EndDo;
		EndDo;
	EndDo;
EndProcedure
